Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/fcw.h
#define FCW_HSMINTENSET_DONE_Pos              _UINT32_(0)                                          /* (FCW_HSMINTENSET) NVM Operation Done Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_DONE_Msk              (_UINT32_(0x1) << FCW_HSMINTENSET_DONE_Pos)          /* (FCW_HSMINTENSET) NVM Operation Done Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_DONE(value)           (FCW_HSMINTENSET_DONE_Msk & (_UINT32_(value) << FCW_HSMINTENSET_DONE_Pos)) /* Assigment of value for DONE in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_KEYERR_Pos            _UINT32_(1)                                          /* (FCW_HSMINTENSET) Key Error Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_KEYERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENSET_KEYERR_Pos)        /* (FCW_HSMINTENSET) Key Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_KEYERR(value)         (FCW_HSMINTENSET_KEYERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_KEYERR_Pos)) /* Assigment of value for KEYERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_CFGERR_Pos            _UINT32_(2)                                          /* (FCW_HSMINTENSET) Configuration Error Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_CFGERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENSET_CFGERR_Pos)        /* (FCW_HSMINTENSET) Configuration Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_CFGERR(value)         (FCW_HSMINTENSET_CFGERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_CFGERR_Pos)) /* Assigment of value for CFGERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_FIFOERR_Pos           _UINT32_(3)                                          /* (FCW_HSMINTENSET) FIFO Underrun during Row Write Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_FIFOERR_Msk           (_UINT32_(0x1) << FCW_HSMINTENSET_FIFOERR_Pos)       /* (FCW_HSMINTENSET) FIFO Underrun during Row Write Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_FIFOERR(value)        (FCW_HSMINTENSET_FIFOERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_FIFOERR_Pos)) /* Assigment of value for FIFOERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_BUSERR_Pos            _UINT32_(4)                                          /* (FCW_HSMINTENSET) AHB Bus Error during Row Write Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_BUSERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENSET_BUSERR_Pos)        /* (FCW_HSMINTENSET) AHB Bus Error during Row Write Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_BUSERR(value)         (FCW_HSMINTENSET_BUSERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_BUSERR_Pos)) /* Assigment of value for BUSERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_WPERR_Pos             _UINT32_(5)                                          /* (FCW_HSMINTENSET) Write Protection Error Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_WPERR_Msk             (_UINT32_(0x1) << FCW_HSMINTENSET_WPERR_Pos)         /* (FCW_HSMINTENSET) Write Protection Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_WPERR(value)          (FCW_HSMINTENSET_WPERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_WPERR_Pos)) /* Assigment of value for WPERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_OPERR_Pos             _UINT32_(6)                                          /* (FCW_HSMINTENSET) NVMOP Error Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_OPERR_Msk             (_UINT32_(0x1) << FCW_HSMINTENSET_OPERR_Pos)         /* (FCW_HSMINTENSET) NVMOP Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_OPERR(value)          (FCW_HSMINTENSET_OPERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_OPERR_Pos)) /* Assigment of value for OPERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_SECERR_Pos            _UINT32_(7)                                          /* (FCW_HSMINTENSET) Security Violation Error Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_SECERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENSET_SECERR_Pos)        /* (FCW_HSMINTENSET) Security Violation Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_SECERR(value)         (FCW_HSMINTENSET_SECERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_SECERR_Pos)) /* Assigment of value for SECERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_HTDPGM_Pos            _UINT32_(8)                                          /* (FCW_HSMINTENSET) High Temperature Detect Error Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_HTDPGM_Msk            (_UINT32_(0x1) << FCW_HSMINTENSET_HTDPGM_Pos)        /* (FCW_HSMINTENSET) High Temperature Detect Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_HTDPGM(value)         (FCW_HSMINTENSET_HTDPGM_Msk & (_UINT32_(value) << FCW_HSMINTENSET_HTDPGM_Pos)) /* Assigment of value for HTDPGM in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_BORERR_Pos            _UINT32_(12)                                         /* (FCW_HSMINTENSET) Brown Out Detect Error Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_BORERR_Msk            (_UINT32_(0x1) << FCW_HSMINTENSET_BORERR_Pos)        /* (FCW_HSMINTENSET) Brown Out Detect Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_BORERR(value)         (FCW_HSMINTENSET_BORERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_BORERR_Pos)) /* Assigment of value for BORERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_WRERR_Pos             _UINT32_(13)                                         /* (FCW_HSMINTENSET) Write Error Interrupt Enable Bit Position */
#define FCW_HSMINTENSET_WRERR_Msk             (_UINT32_(0x1) << FCW_HSMINTENSET_WRERR_Pos)         /* (FCW_HSMINTENSET) Write Error Interrupt Enable Bit Mask */
#define FCW_HSMINTENSET_WRERR(value)          (FCW_HSMINTENSET_WRERR_Msk & (_UINT32_(value) << FCW_HSMINTENSET_WRERR_Pos)) /* Assigment of value for WRERR in the FCW_HSMINTENSET register */
#define FCW_HSMINTENSET_Msk                   _UINT32_(0x000031FF)                                 /* (FCW_HSMINTENSET) Register Mask  */


/* -------- FCW_HSMINTFLAG : (FCW Offset: 0x88) (R/W 32) HSM NVM Interrupt Flag Register -------- */
#define FCW_HSMINTFLAG_RESETVALUE             _UINT32_(0x00)                                       /*  (FCW_HSMINTFLAG) HSM NVM Interrupt Flag Register  Reset Value */

#define FCW_HSMINTFLAG_DONE_Pos               _UINT32_(0)                                          /* (FCW_HSMINTFLAG) NVM Operation Done Flag Bit Position */
#define FCW_HSMINTFLAG_DONE_Msk               (_UINT32_(0x1) << FCW_HSMINTFLAG_DONE_Pos)           /* (FCW_HSMINTFLAG) NVM Operation Done Flag Bit Mask */
#define FCW_HSMINTFLAG_DONE(value)            (FCW_HSMINTFLAG_DONE_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_DONE_Pos)) /* Assigment of value for DONE in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_KEYERR_Pos             _UINT32_(1)                                          /* (FCW_HSMINTFLAG) Key Error Flag Bit Position */
#define FCW_HSMINTFLAG_KEYERR_Msk             (_UINT32_(0x1) << FCW_HSMINTFLAG_KEYERR_Pos)         /* (FCW_HSMINTFLAG) Key Error Flag Bit Mask */
#define FCW_HSMINTFLAG_KEYERR(value)          (FCW_HSMINTFLAG_KEYERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_KEYERR_Pos)) /* Assigment of value for KEYERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_CFGERR_Pos             _UINT32_(2)                                          /* (FCW_HSMINTFLAG) Configuration Error Flag Bit Position */
#define FCW_HSMINTFLAG_CFGERR_Msk             (_UINT32_(0x1) << FCW_HSMINTFLAG_CFGERR_Pos)         /* (FCW_HSMINTFLAG) Configuration Error Flag Bit Mask */
#define FCW_HSMINTFLAG_CFGERR(value)          (FCW_HSMINTFLAG_CFGERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_CFGERR_Pos)) /* Assigment of value for CFGERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_FIFOERR_Pos            _UINT32_(3)                                          /* (FCW_HSMINTFLAG) FIFO Underrun during Row Write Flag Bit Position */
#define FCW_HSMINTFLAG_FIFOERR_Msk            (_UINT32_(0x1) << FCW_HSMINTFLAG_FIFOERR_Pos)        /* (FCW_HSMINTFLAG) FIFO Underrun during Row Write Flag Bit Mask */
#define FCW_HSMINTFLAG_FIFOERR(value)         (FCW_HSMINTFLAG_FIFOERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_FIFOERR_Pos)) /* Assigment of value for FIFOERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_BUSERR_Pos             _UINT32_(4)                                          /* (FCW_HSMINTFLAG) AHB Bus Error during Row Write Flag Bit Position */
#define FCW_HSMINTFLAG_BUSERR_Msk             (_UINT32_(0x1) << FCW_HSMINTFLAG_BUSERR_Pos)         /* (FCW_HSMINTFLAG) AHB Bus Error during Row Write Flag Bit Mask */
#define FCW_HSMINTFLAG_BUSERR(value)          (FCW_HSMINTFLAG_BUSERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_BUSERR_Pos)) /* Assigment of value for BUSERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_WPERR_Pos              _UINT32_(5)                                          /* (FCW_HSMINTFLAG) Write Protection Error Flag Bit Position */
#define FCW_HSMINTFLAG_WPERR_Msk              (_UINT32_(0x1) << FCW_HSMINTFLAG_WPERR_Pos)          /* (FCW_HSMINTFLAG) Write Protection Error Flag Bit Mask */
#define FCW_HSMINTFLAG_WPERR(value)           (FCW_HSMINTFLAG_WPERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_WPERR_Pos)) /* Assigment of value for WPERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_OPERR_Pos              _UINT32_(6)                                          /* (FCW_HSMINTFLAG) NVMOP Error Flag Bit Position */
#define FCW_HSMINTFLAG_OPERR_Msk              (_UINT32_(0x1) << FCW_HSMINTFLAG_OPERR_Pos)          /* (FCW_HSMINTFLAG) NVMOP Error Flag Bit Mask */
#define FCW_HSMINTFLAG_OPERR(value)           (FCW_HSMINTFLAG_OPERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_OPERR_Pos)) /* Assigment of value for OPERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_SECERR_Pos             _UINT32_(7)                                          /* (FCW_HSMINTFLAG) Security Violation Error Bit Position */
#define FCW_HSMINTFLAG_SECERR_Msk             (_UINT32_(0x1) << FCW_HSMINTFLAG_SECERR_Pos)         /* (FCW_HSMINTFLAG) Security Violation Error Bit Mask */
#define FCW_HSMINTFLAG_SECERR(value)          (FCW_HSMINTFLAG_SECERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_SECERR_Pos)) /* Assigment of value for SECERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_HTDPGM_Pos             _UINT32_(8)                                          /* (FCW_HSMINTFLAG) High Temperature Detect Error Flag Bit Position */
#define FCW_HSMINTFLAG_HTDPGM_Msk             (_UINT32_(0x1) << FCW_HSMINTFLAG_HTDPGM_Pos)         /* (FCW_HSMINTFLAG) High Temperature Detect Error Flag Bit Mask */
#define FCW_HSMINTFLAG_HTDPGM(value)          (FCW_HSMINTFLAG_HTDPGM_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_HTDPGM_Pos)) /* Assigment of value for HTDPGM in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_BORERR_Pos             _UINT32_(12)                                         /* (FCW_HSMINTFLAG) Brown Out Detect Error Flag Bit Position */
#define FCW_HSMINTFLAG_BORERR_Msk             (_UINT32_(0x1) << FCW_HSMINTFLAG_BORERR_Pos)         /* (FCW_HSMINTFLAG) Brown Out Detect Error Flag Bit Mask */
#define FCW_HSMINTFLAG_BORERR(value)          (FCW_HSMINTFLAG_BORERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_BORERR_Pos)) /* Assigment of value for BORERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_WRERR_Pos              _UINT32_(13)                                         /* (FCW_HSMINTFLAG) Write Error Flag Bit Position */
#define FCW_HSMINTFLAG_WRERR_Msk              (_UINT32_(0x1) << FCW_HSMINTFLAG_WRERR_Pos)          /* (FCW_HSMINTFLAG) Write Error Flag Bit Mask */
#define FCW_HSMINTFLAG_WRERR(value)           (FCW_HSMINTFLAG_WRERR_Msk & (_UINT32_(value) << FCW_HSMINTFLAG_WRERR_Pos)) /* Assigment of value for WRERR in the FCW_HSMINTFLAG register */
#define FCW_HSMINTFLAG_Msk                    _UINT32_(0x000031FF)                                 /* (FCW_HSMINTFLAG) Register Mask  */


